{
  "projetos": [
    {
      "nome": "Site para ajudar os eleitores a acompanhar e escolher vereadores (API)",
      "descricao": "Desenvolvi em equipe um site que facilita o acesso para o eleitor acompanhar o trabalho dos vereadores de São José dos Campos, inspirado no site da camaraSemPapel.",
      "tecnologias": "Flask, MySQL, HTML, CSS, JavaScript, GIT, Jira",
      "desafio": "Desenvolver a página sobre nós, que mostra um pouco sobre os membros do grupo de API, implementei as rotas no Flask, implementei a lógica do campo de busca na página menu.",
      "solucao": "Utilizei o micro framework Flask junto com HTML e CSS para facilitar a implementação de uma interface Web intuitiva.",
      "repositorio": "https://github.com/Byte-Team-Fatec/Byte_Team-API-1-",
      "imagem": "/images/projeto-1sem.png"
    },
    {
      "nome": "Dashboard Web com Dados de Impacto (API)",
      "descricao": "Projeto desenvolvido para a plataforma Helpnei.",
      "tecnologias": "Node.js, Express, Mysql, HTML/CSS, JavaScript, React, Typescript, GIT, Jira",
      "desafio": "Foco em exibição de indicadores estratégicos para patrocinadores, administradores e stakeholders.",
      "solucao": "Integração de biblioteca JavaScript com API REST para uma interface intuitiva.",
      "repositorio": "https://github.com/ORBIS-2DSM-API/orbis-main",
      "imagem": "/images/helpnei.png"
    },
    {
      "nome": "Sistema de gerenciamento de tarefas (API)",
      "descricao": "Projeto desenvolvido para a plataforma GSW para o gerenciamento de tarefas.",
      "tecnologias": "React, Typescript, HTML, TailwindCSS, VITE, Java, Spring-boot, Maven, MongoDb, GIT, Jira",
      "desafio": "O desafio é oferecer uma solução que simplifique o processo de gerenciamento de tarefas, permitindo que todos os integrantes da equipe tenham visibilidade sobre o andamento das tarefas, possam colaborar em tempo real e anexar documentos de suporte diretamente às atividades.",
      "solucao": "Desenvolver uma aplicação web responsiva, utilizando React, TypeScript e Vite no frontend, garantindo alta performance, modularidade e excelente experiência de uso em dispositivos desktop e mobile. O backend foi implementado em Java com Spring Boot, estruturado em arquitetura de microserviços, permitindo escalabilidade, fácil manutenção e comunicação eficiente entre os serviços.",
      "repositorio": "https://github.com/Syntax-Fatec-SJC/SideQuest",
      "imagem": "/images/gerenciamento-de-tarefas-3semestre.png"
    }
  ],
  "curriculo": {
    "education": "Cursando Desenvolvimento de Software Multiplataforma – FATEC-SJC (2024-2027)",
    "certifications": "Certificação em Desenvolvimento Web Full Stack pela Trybe\nDesenvolvimento Web - Udemy\nPython para Data Science - Coursera\nEspecialização em Data Science - Coursera (Set/2023)\nHackathon XPTO 2023 - 2º lugar em Inovação Tecnológica"
  },
  "skills": {
    "technical": [
      {
        "name": "Linguagens: HTML5, CSS3, TailwindCSS, JavaScript, TypeScript, C#, Python, SQL, Java",
        "type": "technical"
      },
      {
        "name": "Frameworks: React, Node.js, Express, .NET Core, Flask, VITE, Spring-boot",
        "type": "technical"
      },
      {
        "name": "Ferramentas: GitHub, MySQL, AWS, Jira",
        "type": "technical"
      }
    ],
    "soft": [
      {
        "name": "Comunicação assertiva e clara",
        "type": "soft"
      },
      {
        "name": "Colaboração efetiva em equipes multidisciplinares",
        "type": "soft"
      },
      {
        "name": "Adaptabilidade e aprendizado contínuo",
        "type": "soft"
      }
    ]
  }
}